#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.azurerm_resource_group.main_group: Reading...
data.azurerm_resource_group.main_group: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group]
module.azure.data.azurerm_virtual_network.virtual_network: Reading...
module.azure.data.azurerm_storage_account.storage_account_terraform: Reading...
module.azure.data.azurerm_storage_account.log_storage_account: Reading...
module.azure.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network]
module.azure.data.azurerm_subnet.api_subnet: Reading...
module.azure.data.azurerm_storage_account.storage_account_terraform: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Storage/storageAccounts/sandubaterraform]
module.azure.data.azurerm_storage_account.log_storage_account: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Storage/storageAccounts/sandubalog]
module.azure.data.azurerm_log_analytics_workspace.log_workspace: Reading...
module.azure.data.azurerm_subnet.api_subnet: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-customer-subnet]
module.azure.data.azurerm_log_analytics_workspace.log_workspace: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.OperationalInsights/workspaces/fiap-tech-challenge-observability-workspace]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure.azurerm_linux_function_app.linux_function will be created
  + resource "azurerm_linux_function_app" "linux_function" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus2"
      + name                                           = "sanduba-customer-function"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "fiap-tech-challenge-customer-group"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "sandubaterraform"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "environment" = "staging"
        }
      + virtual_network_subnet_id                      = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-customer-subnet"
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + use_dotnet_isolated_runtime = false

              + docker {
                  + image_name   = "cangelosilima/sanduba-customer-api"
                  + image_tag    = "latest"
                  + registry_url = "https://index.docker.io"
                }
            }
        }
    }

  # module.azure.azurerm_monitor_diagnostic_setting.function_monitor will be created
  + resource "azurerm_monitor_diagnostic_setting" "function_monitor" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.OperationalInsights/workspaces/fiap-tech-challenge-observability-workspace"
      + name                           = "fiap-tech-challenge-customer-monitor"
      + storage_account_id             = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Storage/storageAccounts/sandubalog"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FunctionAppLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.azure.azurerm_mssql_database.sanduba_customer_database will be created
  + resource "azurerm_mssql_database" "sanduba_customer_database" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + geo_backup_enabled                                         = false
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 2
      + min_capacity                                               = (known after apply)
      + name                                                       = "sanduba-customer-database"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = false
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Local"
      + tags                                                       = {
          + "environment" = "staging"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = false
    }

  # module.azure.azurerm_mssql_firewall_rule.sqlserver_allow_azure_services_rule will be created
  + resource "azurerm_mssql_firewall_rule" "sqlserver_allow_azure_services_rule" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "Allow access to Azure services"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # module.azure.azurerm_mssql_firewall_rule.sqlserver_allow_home_ip_rule will be created
  + resource "azurerm_mssql_firewall_rule" "sqlserver_allow_home_ip_rule" {
      + end_ip_address   = (sensitive value)
      + id               = (known after apply)
      + name             = "Allow access to Home IP"
      + server_id        = (known after apply)
      + start_ip_address = (sensitive value)
    }

  # module.azure.azurerm_mssql_server.sqlserver will be created
  + resource "azurerm_mssql_server" "sqlserver" {
      + administrator_login                  = (known after apply)
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "eastus2"
      + minimum_tls_version                  = "1.2"
      + name                                 = "sanduba-customer-sqlserver"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "fiap-tech-challenge-customer-group"
      + restorable_dropped_database_ids      = (known after apply)
      + tags                                 = {
          + "environment" = "staging"
        }
      + version                              = "12.0"
    }

  # module.azure.azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "fiap-tech-challenge-customer-group"
      + tags     = {
          + "environment" = "staging"
        }
    }

  # module.azure.azurerm_service_plan.customer_plan will be created
  + resource "azurerm_service_plan" "customer_plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus2"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "customer-app-service-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "fiap-tech-challenge-customer-group"
      + sku_name                     = "B1"
      + tags                         = {
          + "environment" = "staging"
        }
      + worker_count                 = (known after apply)
    }

  # module.azure.random_password.sqlserver_password will be created
  + resource "random_password" "sqlserver_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.azure.random_uuid.auth_secret_key will be created
  + resource "random_uuid" "auth_secret_key" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.azure.random_uuid.sqlserver_user will be created
  + resource "random_uuid" "sqlserver_user" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.github.github_actions_organization_secret.database_connectionstring will be created
  + resource "github_actions_organization_secret" "database_connectionstring" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "APP_CUSTOMER_DATABASE_CONNECTION_STRING"
      + updated_at      = (known after apply)
      + visibility      = "all"
    }

  # module.github.github_actions_organization_secret.github_auth_secret_key will be created
  + resource "github_actions_organization_secret" "github_auth_secret_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "APP_AUTH_SECRET_KEY"
      + updated_at      = (known after apply)
      + visibility      = "all"
    }

  # module.github.github_actions_organization_variable.sanduba_customer_url will be created
  + resource "github_actions_organization_variable" "sanduba_customer_url" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "APP_CUSTOMER_URL"
      + visibility    = "all"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cangelosilima, Action: `pull_request`*